In [1]:
import pandas as pd
df = pd.read_csv(r"C:\Users\abhis\Downloads\bike_sales_india.csv")
df.head(5)

,State,Avg Daily Distance (km),Brand,Model,Price (INR),Year of Manufacture,Engine Capacity (cc),Fuel Type,Mileage (km/l),Owner Type,Registration Year,Insurance Status,Seller Type,Resale Price (INR),City Tier
0,Karnataka,68.84,Royal Enfield,Hunter 350,252816,2021,672,Electric,78.41,Second,2024,Active,Individual,149934.18,Tier 3
1,Rajasthan,23.80,Bajaj,Dominar 400,131100,2020,769,Hybrid,89.98,Third,2023,Active,Individual,66960.30,Tier 3
2,Madhya Pradesh,27.67,KTM,125 Duke,201016,2020,216,Hybrid,71.46,Second,2023,Active,Dealer,141522.64,Tier 3
3,Karnataka,62.85,Kawasaki,Ninja 300,132482,2021,556,Petrol,51.73,Third,2021,Active,Dealer,56057.22,Tier 1
4,Madhya Pradesh,10.62,Yamaha,FZ V3,231796,2019,298,Petrol,54.72,Third,2019,Not Available,Individual,132538.36,Tier 3

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 15 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   State                    10000 non-null  object
 1   Avg Daily Distance (km)  10000 non-null  float64
 2   Brand                    10000 non-null  object
 3   Model                    10000 non-null  object
 4   Price (INR)              10000 non-null  int64
 5   Year of Manufacture      10000 non-null  int64
 6   Engine Capacity (cc)     10000 non-null  int64
 7   Fuel Type                10000 non-null  object
 8   Mileage (km/l)           10000 non-null  float64
 9   Owner Type               10000 non-null  object
 10  Registration Year        10000 non-null  int64
 11  Insurance Status         10000 non-null  object
 12  Seller Type              10000 non-null  object
 13  Resale Price (INR)       10000 non-null  float64
 14  City Tier                10000 non-null  object
dtypes: float64(3), int64(4), object(8)
memory usage: 1.1+ MB

In [3]:
df.describe(include = "all")

,State,Avg Daily Distance (km),Brand,Model,Price (INR),Year of Manufacture,Engine Capacity (cc),Fuel Type,Mileage (km/l),Owner Type,Registration Year,Insurance Status,Seller Type,Resale Price (INR),City Tier
count,10000,10000.000000,10000,10000,10000.000000,10000.000000,10000.000000,10000,10000.000000,10000,10000.00000,10000,10000,10000.000000,10000
unique,10,NaN,8,40,NaN,NaN,NaN,3,NaN,3,NaN,3,2,NaN,4
top,Punjab,NaN,Kawasaki,Ray ZR,NaN,NaN,NaN,Hybrid,NaN,First,NaN,Expired,Dealer,NaN,Tier 3
freq,1051,NaN,1291,279,NaN,NaN,NaN,3360,NaN,3407,NaN,3429,5035,NaN,2617
mean,NaN,42.533128,NaN,NaN,224328.722400,2019.510500,552.695300,NaN,67.188926,NaN,2020.96510,NaN,NaN,133828.973998,NaN
std,NaN,21.676985,NaN,NaN,100753.660447,2.907668,261.176292,NaN,20.891728,NaN,2.74897,NaN,NaN,66613.220382,NaN
min,NaN,5.010000,NaN,NaN,50031.000000,2015.000000,100.000000,NaN,25.000000,NaN,2015.00000,NaN,NaN,20532.070000,NaN
25%,NaN,23.907500,NaN,NaN,137900.250000,2017.000000,327.000000,NaN,50.680000,NaN,2019.00000,NaN,NaN,78680.905000,NaN
50%,NaN,42.480000,NaN,NaN,223878.000000,2019.000000,553.000000,NaN,69.850000,NaN,2022.00000,NaN,NaN,128148.340000,NaN
75%,NaN,61.352500,NaN,NaN,311464.250000,2022.000000,780.000000,NaN,84.542500,NaN,2023.00000,NaN,NaN,181048.192500,NaN
max,NaN,80.000000,NaN,NaN,399981.000000,2024.000000,1000.000000,NaN,100.000000,NaN,2024.00000,NaN,NaN,317302.450000,NaN

In [4]:
df.columns

Index(['State', 'Avg Daily Distance (km)', 'Brand', 'Model', 'Price (INR)',
       'Year of Manufacture', 'Engine Capacity (cc)', 'Fuel Type',
       'Mileage (km/l)', 'Owner Type', 'Registration Year', 'Insurance Status',
       'Seller Type', 'Resale Price (INR)', 'City Tier'],
      dtype='object')

In [5]:
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
9995    False
9996    False
9997    False
9998    False
9999    False
Length: 10000, dtype: bool

In [6]:
df.isna().sum()

State                      0
Avg Daily Distance (km)    0
Brand                      0
Model                      0
Price (INR)                0
Year of Manufacture        0
Engine Capacity (cc)       0
Fuel Type                  0
Mileage (km/l)             0
Owner Type                 0
Registration Year          0
Insurance Status           0
Seller Type                0
Resale Price (INR)         0
City Tier                  0
dtype: int64

In [7]:
df.columns = df.columns.str.lower()
df.columns = df.columns.str.replace(" ","_")
df = df.rename(columns = {
    "avg_daily_distance_(km)" : "avg_daily_distance",
    "price_(inr)" : "price",
    "mileage_(km/l)" : "mileage",
    "year_of_manufacture" : "manufacturing_year",
    "engine_capacity_(cc)" : "engine_cc",
    "resale_price_(inr)" : "resale_price"
})

In [8]:
df.columns

Index(['state', 'avg_daily_distance', 'brand', 'model', 'price',
       'manufacturing_year', 'engine_cc', 'fuel_type', 'mileage', 'owner_type',
       'registration_year', 'insurance_status', 'seller_type', 'resale_price',
       'city_tier'],
      dtype='object')

In [9]:
df["depreciation"] = df["price"] - df["resale_price"]
df["depreciation"] = df["depreciation"].round(2)

In [10]:
df.head(5)

,state,avg_daily_distance,brand,model,price,manufacturing_year,engine_cc,fuel_type,mileage,owner_type,registration_year,insurance_status,seller_type,resale_price,city_tier,depreciation
0,Karnataka,68.84,Royal Enfield,Hunter 350,252816,2021,672,Electric,78.41,Second,2024,Active,Individual,149934.18,Tier 3,102881.82
1,Rajasthan,23.80,Bajaj,Dominar 400,131100,2020,769,Hybrid,89.98,Third,2023,Active,Individual,66960.30,Tier 3,64139.70
2,Madhya Pradesh,27.67,KTM,125 Duke,201016,2020,216,Hybrid,71.46,Second,2023,Active,Dealer,141522.64,Tier 3,59493.36
3,Karnataka,62.85,Kawasaki,Ninja 300,132482,2021,556,Petrol,51.73,Third,2021,Active,Dealer,56057.22,Tier 1,76424.78
4,Madhya Pradesh,10.62,Yamaha,FZ V3,231796,2019,298,Petrol,54.72,Third,2019,Not Available,Individual,132538.36,Tier 3,99257.64

In [30]:
q1 = df["price"].quantile(0.25)
q3 = df["price"].quantile(0.75)
iqr = q3 - q1
low = q1-(1.5*iqr)
high = q3+(1.5*iqr)

df[(df["price"]>high) | (df["price"]<low)]

Empty DataFrame
Columns: [state, avg_daily_distance, brand, model, price, manufacturing_year, engine_cc, fuel_type, mileage, owner_type, registration_year, insurance_status, seller_type, resale_price, city_tier, depreciation, price_segment]
Index: []

In [33]:
q1 = df["resale_price"].quantile(0.25)
q3 = df["resale_price"].quantile(0.75)
iqr = q3 - q1
low = q1-(1.5*iqr)
high = q3+(1.5*iqr)

df[(df["resale_price"]>high) | (df["resale_price"]<low)]

Empty DataFrame
Columns: [state, avg_daily_distance, brand, model, price, manufacturing_year, engine_cc, fuel_type, mileage, owner_type, registration_year, insurance_status, seller_type, resale_price, city_tier, depreciation, price_segment]
Index: []

In [31]:
def segment(price):
    if price < 100000:
        return "Low"
    elif price < 200000:
        return "Medium"
    elif price < 300000:
        return "High"
    else: 
        return "premium"
;
df["price_segment"] = df["price"].apply(segment)

In [12]:
df[["price" , "price_segment"]]

       price price_segment
0     252816          High
1     131100        Medium
2     201016          High
3     132482        Medium
4     231796          High
...      ...           ...
9995   95040           Low
9996  110369        Medium
9997  313806       premium
9998  204068          High
9999  323583       premium

[10000 rows x 2 columns]

In [14]:
df["insurance_status"].unique()

array(['Active', 'Not Available', 'Expired'], dtype=object)

In [49]:
df["depreciation_percentage"] = (
    (df["price"] - df["resale_price"]) /
     df["price"]
) * 100

In [61]:
df["depreciation_percentage"] = df["depreciation_percentage"].round(2)

In [62]:
df[["depreciation" , "depreciation_percentage"]]

      depreciation  depreciation_percentage
0        102881.82                    40.69
1         64139.70                    48.92
2         59493.36                    29.60
3         76424.78                    57.69
4         99257.64                    42.82
...            ...                      ...
9995      33014.80                    34.74
9996      29990.60                    27.17
9997     114299.30                    36.42
9998      73089.30                    35.82
9999     181443.15                    56.07

[10000 rows x 2 columns]

In [63]:
from sqlalchemy import create_engine

username = "postgres"
password = "abhishekk23"
host = "localhost"
port = "5432"
database = "bike_sales"

engine = create_engine(f"postgresql+psycopg2://{username}:{password}@{host}:{port}/{database}")
table_name = "bike_sale"
df.to_sql(table_name, engine, if_exists = "replace", index = False)
print(f"data load succesfully '{table_name}' in '{database}'.")

data load succesfully 'bike_sale' in 'bike_sales'.